Revit 2027 API
TemporaryViewModes.IsModeAvailable Method
 Tests whether a temporary view mode is currently available in the associated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModeAvailable(
	TemporaryViewMode mode
)
Public Function IsModeAvailable (
	mode As TemporaryViewMode
) As Boolean
public:
bool IsModeAvailable(
	TemporaryViewMode mode
)
member IsModeAvailable :
        mode : TemporaryViewMode -> bool
Parameters
mode TemporaryViewMode
 The mode to evaluate
Return Value
Boolean
 True of the temporary mode is currently available in the associated view.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
Not every mode is available in all views at all times. Some of the modes are only available in certain views, or only at certain time/context. Modes that are not available will not be visible on the view's tool bar in the UI.
Even modes that are available do not have to be currently enabled in the current context. Before using a mode its applicability should be tested by calling IsModeEnabled(TemporaryViewMode).
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace